src/Catalogs/ОбъектыНедвижимости.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ОбъектыНедвижимости</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Тип</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыОбъектовНедвижимости</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Адрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заметка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Архив</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Enums/ТипыОбъектовНедвижимости.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ТипыОбъектовНедвижимости</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Дом</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Квартира</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Дача</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Гараж</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Мастерская</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Другое</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Catalogs/ОбъектыНедвижимости/Ext/ObjectModule.bsl
// Дом: квартира, дача, гараж — верхний уровень хозяйства (METADATA §2.1).
// Вместо удаления дом уходит в архив вместе с местами (сервис Дома).

Перем НоваяЗапись;    // признак новой записи между ПередЗаписью и ПриЗаписи
Перем ИзменилсяАрхив; // изменился ли признак «Архив» относительно базы

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)

	Если Тип.Пустая() Тогда
		Тип = Перечисления.ТипыОбъектовНедвижимости.Квартира;
	КонецЕсли;

КонецПроцедуры

Процедура ПередЗаписью(Отказ)

	НоваяЗапись = ЭтоНовый();
	ИзменилсяАрхив = НЕ НоваяЗапись И Дома.ИзменилсяАрхив(Ссылка, Архив);

	Если ПометкаУдаления И СодержитМеста() Тогда
		Отказ = Истина;
		СообщитьПользователю(НСтр("ru = 'В этом доме есть места. Перенесите их в архив вместе с домом'"));
	КонецЕсли;

КонецПроцедуры

Процедура ПриЗаписи(Отказ)

	// Только что созданный дом становится выбранным: с него начинают знакомство.
	Если НоваяЗапись Тогда
		Дома.ЗапомнитьПоследнийДом(Ссылка);
	КонецЕсли;

	// Признак «Архив» уходит местам верхнего уровня, дальше по дереву — событиями мест.
	Если ИзменилсяАрхив И НЕ ОбменДанными.Загрузка Тогда
		Дома.ЗаписатьАрхивМестамДома(Ссылка, Архив);
	КонецЕсли;

КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)

	Если ПустаяСтрока(Наименование) Тогда
		Отказ = Истина;
		СообщитьПользователю(НСтр("ru = 'Укажите название — без него дом не найти в поиске.'"),
			"Наименование");
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Есть ли у дома хотя бы одно место, включая архивные и помеченные на удаление.
Функция СодержитМеста()

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КОЛИЧЕСТВО(*) КАК Количество
	|ИЗ
	|	Справочник.МестаХранения КАК МестаХранения
	|ГДЕ
	|	МестаХранения.Владелец = &Владелец";
	Запрос.УстановитьПараметр("Владелец", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	Если НЕ Выборка.Следующий() Тогда
		Возврат Ложь;
	КонецЕсли;
	Возврат Выборка.Количество > 0;

КонецФункции

Процедура СообщитьПользователю(Текст, Поле = "")

	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = Текст;
	Сообщение.Поле = Поле;
	Сообщение.Сообщить();

КонецПроцедуры

#КонецОбласти
